# autoconf and automake are needed for building some packages from source,
# primarily through asdf-vm

# Install with "brew bundle"
tap "homebrew/bundle"
tap "homebrew/core"
brew "ack"
brew "autoconf"
brew "automake"
brew "bash"
brew "bats-core"
brew "bind"
brew "coreutils"
brew "curl"
brew "exercism"
brew "findutils"
brew "git"
brew "gnupg"
brew "grep"
brew "irssi"
brew "mtr"
brew "ngrep"
brew "tig"
brew "wget"

# This was from an older iMac
# I don't want some of these managed by homebrew anymore
# left it here for reference
#tap "homebrew/bundle"
#tap "homebrew/core"
#brew "ack"
#brew "readline"
#brew "asciidoctor"
#brew "autoconf"
#brew "automake"
#brew "bash"
#brew "bind"
#brew "cmake"
#brew "coreutils"
#brew "curl"
#brew "exercism"
#brew "gcc"
#brew "git"
#brew "gradle"
#brew "grep"
#brew "groovysdk"
#brew "irssi"
#brew "libksba"
#brew "liquibase"
#brew "mtr"
#brew "nginx"
#brew "ngrep"
#brew "tig"
#brew "ucspi-tcp"
#brew "wget"
