# "brew bundle dump" creates this file

# autoconf and automake are needed for building some packages from source,
# primarily through asdf-vm

I used pre-commit years ago, not sure if I want to keep using it or not

mkcert and nss are needed for https localhost dev work (nss is only needed for firefox)

I need to figure out where/how to keep track of comments. Becuase for libyaml, there are some comments I want to keep track of.
For libyaml, this is the same on Linux and Mac
# libyaml is needed to install ruby with asdf https://github.com/rbenv/ruby-build/discussions/2012



# Install with "brew bundle"
tap "homebrew/bundle"
brew "ack"
brew "asdf"
brew "autoconf"
brew "automake"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "bats-core"
brew "bind"
brew "btop"
brew "coreutils"
brew "curl"
brew "entr"
brew "exa"
brew "exercism"
brew "findutils"
brew "gawk"
brew "gcc"
brew "git"
brew "gh"
brew "gnupg"
brew "gradle"
brew "grep"
brew "irssi"
brew "jq"
brew "less"
brew "libyaml"
brew "lua-language-server"
brew "mtr"
brew "ncurses"
brew "neovim"
brew "ngrep"
brew "readline"
brew "rsync"
brew "sponge"
brew "tig"
brew "tree"

brew "tmux"
#brew "ucspi-tcp"
brew "vim"
brew "watch"
brew "wget"
